[
    {
        "name": "Rondo in D Major K. 485",
        "description": "Written by Mozart, I performed this Rondo at my final Formal Recital!",
        "videoId": "AtwasYkNRlc",
        "date": "August 2021 to January 2022"
    },
    {
        "name": "Valse Caressante",
        "description": "I had a blast learning this Respighi Waltz!  It wasn't a super tricky piece, and I loved the fluid beat.",
        "videoId": "-Sgmnh4qp8g",
        "date": "November 2021 to January 2022"
    },
    {
        "name": "Maple Leaf Rag",
        "description": "Maple Leaf Rag was one of my few endeavors into ragtime music, and while I'd be lying if I say if I wanted to play more ragtime, it was fun while it lasted!",
        "videoId": "ZQmmYw3Iq1Q",
        "date": "May 2021 to November 2021"
    },
    {
        "name": "Liebesleid",
        "description": "I love this piece, and although I never perfected it, I'm really proud of the parts that I did learn!",
        "videoId": "rWFgvW5x1gg",
        "date": "January 2021 to August 2021"
    },
    {
        "name": "Harry Potter Medley",
        "description": "This collection of Harry Potter Songs is over 20 pages long and takes around 15 minutes to play!  I learned them slowly and in fragments.",
        "videoId": "R6uoqbH12p8",
        "date": "October 2020 to March 2021"
    },
    {
        "name": "Songs without Words",
        "description": "I performed this for PPA's online formal recital in 2021.  Songs without Words is a collection of over 50 pieces by Mendelssohn, and this is only one of them!",
        "videoId": "1ZwGAsgyILk",
        "date": "September 2020 to January 2021"
    },
    {
        "name": "Doctor Gradus Ad Parnassum",
        "description": "Another one of Debussy's Children's Corner pieces, I love the understated melody of this piece - though the ending isn't my favorite, and it was hard to get a good recording of.",
        "videoId": "3s1FP-k0moc",
        "date": "August 2020 to September 2020"
    },

    {
        "name": "Sonata in A-flat Major K. 127",
        "description": "I started learning this right at the beginning of the pandemic, when we were still very much locked down.  I was so thankful for piano during this time, and learned many pieces during this period.",
        "videoId": "pV_ilwA44SA",
        "date": "April 2020 to May 2020"
    },
    {
        "name": "Golliwogg's Cakewalk",
        "description": "This playful piece was easy to learn and fun to play!  It is one of Debussy's Children's Corner pieces.",
        "videoId": "geeYpxTgLDA",
        "date": "April 2020"
    },
    {
        "name": "Liebestraum",
        "description": "Liebestraum was an incredibly difficult piece.  The cadenzas and middle half of the piece were a slog to get through, but I'm glad I did!",
        "videoId": "pyPGeRHYlGw",
        "date": "January 2020 to June 2020"
    },
    {
        "name": "Wedding Song at Troldhaugen",
        "description": "I was so excited when I found this piece on Youtube!  It's one that I come back to time after time, and still enjoy each time I play.",
        "videoId": "4tckM8XWq6k",
        "date": "January 2020 to April 2020"
    },
    {
        "name": "Sonata Pathetique",
        "description": "This is the first movement of Sonata Pathetique by Beethoven, which I learned during my Sophomore year of High School.  I love the challenge of this piece!",
        "videoId": "zltBrEg72Ng",
        "date": "September 2019 to January 2020"
    },
    {
        "name": "Nocturne Opus 7 No. 1",
        "description": "I departed from my normal baroque or classical music to play this, one of Chopin's most famous nocturnes.",
        "videoId": "iv4hBULpz1c",
        "date": "May 2019 to September 2019"
    },
    {
        "name": "Aufschwung",
        "description": "Even now, I seriously enjoy this piece.  It was a challenging one to learn, but I loved the contrast between bangy and beautiful sections, and the hidden melodies in the LH!",
        "videoId": "pXm7X8GtC6Y",
        "date": "September 2018 to January 2019"
    },
    {
        "name": "Waterfall",
        "description": "Written by Jon Schmidt, Waterfall was an incredibly dramatic and fun piece to play!  Octave runs and funky accents made it a tricky one!",
        "videoId": "DyVmKnELMl0",
        "date": "September 2017 to January 2018"
    },
    {
        "name": "Bach Invention in C Major",
        "description": "If I were to describe my musical preferences at this time, this piece would encapsulate them perfectly!",
        "videoId": "DEQ65OATGk0",
        "date": "January 2017 to May 2017"
    },
    {
        "name": "Praeludium",
        "description": "This is a family classic, with my Great-Grandpa playing this to my Grandma. I loved the shifting melody and challenging arpeggios in the RH!",
        "videoId": "INJP3tGaxuU",
        "date": "June 2016 to January 2017"
    },

    {
        "name": "Bach Partita",
        "description": "This was one of the first long pieces that I learned which spanned multiple movements (Minuet 1, 2, and Gigue).",
        "videoId": "yqWxVNDkJ-I",
        "date": "May 2015 to January 2016"
    },
    {
        "name": "Heavenly Father Loves Me",
        "description": "A duet with my best friend Parker that we played in Church.",
        "videoId": "7nHqys-FS-8",
        "date": "August 2015 to October 2015"
    },
    {
        "name": "Dragonfly Scherzo",
        "description": "A very high energy piece that I played over 7 years ago!",
        "videoId": "2QCGjZqnV_8",
        "date": "January 2015"
    },
    {
        "name": "Concerto",
        "description": "This was performed at my academy's Ensemble Recital with my classmates Parker, Grace, and Remi, with our Teacher Christie Skousen accompanying us.",
        "videoId": "xbWFsTWVBP4",
        "date": "August 2014"
    },
    {
        "name": "Sonatina in C by Clementi",
        "description": "I played the first two movements of this piece at one of my earliest recitals.",
        "videoId": "3h8FCN5_vSA",
        "date": "January 2014"
    },
    {
        "name": "Sakura",
        "description": "We all start from somewhere, and I started with Sakura.  I'm so thankful I started along this journey, and it's amazing to see the progress that I have made!",
        "videoId": "UzwpPLkK4ok",
        "date": "2010"
    }
]
